Информационная_база/src/ExchangePlans/МобильноеПриложение/МобильноеПриложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="45b8ca55-cf30-4d59-8e0c-ff394374dfce">
  <name>МобильноеПриложение</name>
  <attributes>
    <name>Профиль</name>
    <type>
      <types>EnumRef.ПрофилиМобильногоПриложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМобильногоПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоОтветственному</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДПодписчика</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейСинхронизации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничнаяТочка</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоВсемКассамККМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.РолиМобильногоПриложения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Информационная_база/src/Enums/РолиМобильногоПриложения/РолиМобильногоПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиМобильногоПриложения</name>
  <enumValues>
    <name>БазовыеПрава</name>
  </enumValues>
  <enumValues>
    <name>ДвиженияДенегПросмотрИРедактирование</name>
  </enumValues>
  <enumValues>
    <name>ДвиженияДенегТолькоПросмотр</name>
  </enumValues>
  <enumValues>
    <name>ДвиженияТоваровПросмотрИРедактирование</name>
  </enumValues>
  <enumValues>
    <name>ДвиженияТоваровТолькоПросмотр</name>
  </enumValues>
  <enumValues>
    <name>ЗаказыПросмотрИРедактирование</name>
  </enumValues>
  <enumValues>
    <name>ЗаказыТолькоПросмотр</name>
  </enumValues>
  <enumValues>
    <name>КонтрагентыПросмотрИРедактирование</name>
  </enumValues>
  <enumValues>
    <name>КонтрагентыТолькоПросмотр</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйКалендарь</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПросмотрИРедактирование</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураТолькоПросмотр</name>
  </enumValues>
  <enumValues>
    <name>ОтчетДвиженияДенегПросмотр</name>
  </enumValues>
  <enumValues>
    <name>ОтчетДолгиПросмотр</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОстаткиТоваровНаСкладахПросмотр</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПродажиПросмотр</name>
  </enumValues>
  <enumValues>
    <name>ПолныеПрава</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПросмотрИРедактирование</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоТолькоПросмотр</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеОстатокВзаиморасчетов</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеОстатокТоваров</name>
  </enumValues>
  <enumValues>
    <name>РозницаПросмотрИРедактирование</name>
  </enumValues>
  <enumValues>
    <name>РозницаТолькоПросмотр</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОКомпанииПросмотрИРедактирование</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОКомпанииТолькоПросмотр</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Enums/ПрофилиМобильногоПриложения/ПрофилиМобильногоПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПрофилиМобильногоПриложения</name>
  <enumValues>
    <name>Собственник</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйПредставитель</name>
  </enumValues>
  <enumValues>
    <name>СервисныйИнженер</name>
  </enumValues>
  <enumValues>
    <name>Продавец</name>
  </enumValues>
  <enumValues>
    <name>РозничнаяТочка</name>
  </enumValues>
  <enumValues>
    <name>ДетальнаяНастройка</name>
  </enumValues>
  <enumValues>
    <name>МобильнаяТелефония</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/ExchangePlans/МобильноеПриложение/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	ДополнительныеСвойства.Вставить("Загрузка");
	
	Если Роли.Найти(Перечисления.РолиМобильногоПриложения.ПолныеПрава, "Роль") <> Неопределено Тогда
		Роли.Очистить();
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.БазовыеПрава);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ДвиженияДенегПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ДвиженияТоваровПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ПроизводствоПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ЗаказыПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.КонтрагентыПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.НоменклатураПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетДвиженияДенегПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетОстаткиТоваровНаСкладахПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетДолгиПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетПродажиПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ЧтениеОстатокВзаиморасчетов);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ЧтениеОстатокТоваров);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.РозницаПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ИнформацияОКомпанииПросмотрИРедактирование);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРольВТаблицу(Роль) Экспорт
	
	НоваяСтрока = Роли.Добавить();
	НоваяСтрока.Роль = Роль;
	
КонецПроцедуры

Процедура УстановитьРолиПоПрофилю(ПрофильДляУстановки) Экспорт
	
	Профиль = ПрофильДляУстановки;
	
	Роли.Очистить();
	ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.БазовыеПрава);
	
	Если ПрофильДляУстановки = Перечисления.ПрофилиМобильногоПриложения.Собственник Тогда
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.КонтрагентыПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.НоменклатураПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ЗаказыПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ДвиженияДенегПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ДвиженияТоваровПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ПроизводствоПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетДвиженияДенегПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетОстаткиТоваровНаСкладахПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетПродажиПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетДолгиПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.РозницаПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ИнформацияОКомпанииПросмотрИРедактирование);
	ИначеЕсли ПрофильДляУстановки = Перечисления.ПрофилиМобильногоПриложения.Продавец Тогда
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.КонтрагентыПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.НоменклатураТолькоПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ЗаказыПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ДвиженияДенегПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ДвиженияТоваровПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетДвиженияДенегПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетОстаткиТоваровНаСкладахПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетПродажиПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ИнформацияОКомпанииТолькоПросмотр);
	ИначеЕсли ПрофильДляУстановки = Перечисления.ПрофилиМобильногоПриложения.ТорговыйПредставитель Тогда
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.КонтрагентыПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.НоменклатураТолькоПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ЗаказыПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ДвиженияДенегПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ДвиженияТоваровПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетДвиженияДенегПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетОстаткиТоваровНаСкладахПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетДолгиПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ИнформацияОКомпанииТолькоПросмотр);
	ИначеЕсли ПрофильДляУстановки = Перечисления.ПрофилиМобильногоПриложения.СервисныйИнженер Тогда
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.КонтрагентыТолькоПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.НоменклатураТолькоПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ЗаказыПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ДвиженияДенегПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ДвиженияТоваровПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетДвиженияДенегПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетОстаткиТоваровНаСкладахПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ИнформацияОКомпанииТолькоПросмотр);
	ИначеЕсли ПрофильДляУстановки = Перечисления.ПрофилиМобильногоПриложения.РозничнаяТочка Тогда
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.НоменклатураТолькоПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ОтчетПродажиПросмотр);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.РозницаПросмотрИРедактирование);
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.ИнформацияОКомпанииТолькоПросмотр);
	ИначеЕсли ПрофильДляУстановки = Перечисления.ПрофилиМобильногоПриложения.МобильнаяТелефония Тогда
		ДобавитьРольВТаблицу(Перечисления.РолиМобильногоПриложения.КонтрагентыТолькоПросмотр);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
